
__author__ = 'Кравченко Сергей Иванович'

# Задание-1:
# Ваня набрал несколько операций в интерпретаторе и получал результаты:
# 	Код: a == a**2
# 	Результат: True
# 	Код: a == a*2
# 	Результат: True
# 	Код: a > 999999
# 	Результат: True

# Вопрос: Чему была равна переменная a,
# если точно известно, что её значение не изменялось?

# Подсказка: это значение точно есть ;)
# Я предпологаю исходя из выше представленного набора команд и условия не изменности числа,либо это бесконечность, либо 1600000. 
